In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
car_dataset = {
    'Cars' : ['Tesla','BMW','Hyundal'],
    'Model': ['Model S','i3','IONIQ 5'],
    'Range': [391,335,369],
    'Acceleration':[3.7,3.3,4.5]
}

car_data = pd.DataFrame(car_dataset)

In [8]:
car_data

      Cars    Model  Range  Acceleration
0    Tesla  Model S    391           3.7
1      BMW       i3    335           3.3
2  Hyundal  IONIQ 5    369           4.5

In [9]:
type(car_data)

pandas.core.frame.DataFrame

In [10]:
car_data['Cars']

0      Tesla
1        BMW
2    Hyundal
Name: Cars, dtype: object

In [11]:
type(car_data['Cars'])

pandas.core.series.Series

In [12]:
car_data[['Cars','Model']]

      Cars    Model
0    Tesla  Model S
1      BMW       i3
2  Hyundal  IONIQ 5

In [13]:
car_data['Booster'] = np.array([.4,.6,.3])

In [14]:
car_data

      Cars    Model  Range  Acceleration  Booster
0    Tesla  Model S    391           3.7      0.4
1      BMW       i3    335           3.3      0.6
2  Hyundal  IONIQ 5    369           4.5      0.3

In [15]:
car_data['Boosted_Acceleration'] = car_data['Acceleration'] * car_data['Booster']

In [16]:
car_data

      Cars    Model  Range  Acceleration  Booster  Boosted_Acceleration
0    Tesla  Model S    391           3.7      0.4                  1.48
1      BMW       i3    335           3.3      0.6                  1.98
2  Hyundal  IONIQ 5    369           4.5      0.3                  1.35

In [17]:
car_data.drop(columns=['Boosted_Acceleration'], inplace=True)

In [18]:
car_data

      Cars    Model  Range  Acceleration  Booster
0    Tesla  Model S    391           3.7      0.4
1      BMW       i3    335           3.3      0.6
2  Hyundal  IONIQ 5    369           4.5      0.3

In [19]:
car_data.rename(columns={'Cars':'cars'}, inplace=True)

In [20]:
car_data

      cars    Model  Range  Acceleration  Booster
0    Tesla  Model S    391           3.7      0.4
1      BMW       i3    335           3.3      0.6
2  Hyundal  IONIQ 5    369           4.5      0.3

In [21]:
car_data.columns = car_data.columns.str.lower()

In [22]:
car_data

      cars    model  range  acceleration  booster
0    Tesla  Model S    391           3.7      0.4
1      BMW       i3    335           3.3      0.6
2  Hyundal  IONIQ 5    369           4.5      0.3

# Loading Data from csv files

In [23]:
# Read from csv
df = pd.read_csv("Height of Male and Female by Country 2022.csv")
df

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
0,1,Netherlands,183.78,170.36,6.03,5.59
1,2,Montenegro,183.30,169.96,6.01,5.58
2,3,Estonia,182.79,168.66,6.00,5.53
3,4,Bosnia and Herzegovina,182.47,167.47,5.99,5.49
4,5,Iceland,182.10,168.91,5.97,5.54
...,...,...,...,...,...,...
194,195,Mozambique,164.30,155.42,5.39,5.10
195,196,Papua New Guinea,163.10,156.89,5.35,5.15
196,197,Solomon Islands,163.07,156.79,5.35,5.14
197,198,Laos,162.78,153.10,5.34,5.02
198,199,Timor-Leste,160.13,152.71,5.25,5.01

In [24]:
df.head()

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
0,1,Netherlands,183.78,170.36,6.03,5.59
1,2,Montenegro,183.30,169.96,6.01,5.58
2,3,Estonia,182.79,168.66,6.00,5.53
3,4,Bosnia and Herzegovina,182.47,167.47,5.99,5.49
4,5,Iceland,182.10,168.91,5.97,5.54

In [25]:
df.tail()

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
194,195,Mozambique,164.30,155.42,5.39,5.10
195,196,Papua New Guinea,163.10,156.89,5.35,5.15
196,197,Solomon Islands,163.07,156.79,5.35,5.14
197,198,Laos,162.78,153.10,5.34,5.02
198,199,Timor-Leste,160.13,152.71,5.25,5.01

In [26]:
df.shape

(199, 6)

In [27]:
df.columns

Index(['Rank', 'Country Name', 'Male Height in Cm', 'Female Height in Cm',
       'Male Height in Ft', 'Female Height in Ft'],
      dtype='object')

In [28]:
df['Country Name'].unique()

array(['Netherlands', 'Montenegro', 'Estonia', 'Bosnia and Herzegovina',
       'Iceland', 'Denmark', 'Czech Republic', 'Latvia', 'Slovakia',
       'Slovenia', 'Ukraine', 'Croatia', 'Serbia', 'Lithuania', 'Poland',
       'Finland', 'Norway', 'Sweden', 'Germany', 'Dominica', 'Bermuda',
       'Puerto Rico', 'Greece', 'Belgium', 'Ireland', 'Lebanon',
       'Andorra', 'Antigua and Barbuda', 'Australia', 'Canada',
       'Switzerland', 'Grenada', 'Belarus', 'France', 'Austria',
       'Luxembourg', 'Cook Islands', 'French Polynesia', 'United Kingdom',
       'Romania', 'New Zealand', 'Saint Vincent and the Grenadines',
       'Niue', 'American Samoa', 'Barbados', 'Jamaica', 'United States',
       'Tunisia', 'Russia', 'Hungary', 'Saint Lucia', 'North Macedonia',
       'Libya', 'Turkey', 'Morocco', 'Senegal', 'Spain', 'Tokelau',
       'Trinidad and Tobago', 'Israel', 'Georgia', 'Seychelles', 'Brazil',
       'China', 'Iran', 'Moldova', 'South Korea', 'Kazakhstan', 'Tonga',
       'Palestine', 'Algeria', 'Mali', 'Kuwait', 'Jordan', 'Hong Kong',
       'Argentina', 'North Korea', 'Dominican Republic', 'Egypt',
       'Suriname', 'Italy', 'Samoa', 'Bahamas', 'Malta', 'Turkmenistan',
       'Portugal', 'Uruguay', 'Bulgaria', 'United Arab Emirates',
       'Albania', 'Costa Rica', 'Azerbaijan', 'Fiji', 'Greenland',
       'Paraguay', 'Iraq', 'Saint Kitts and Nevis', 'Armenia', 'Cuba',
       'Venezuela', 'Taiwan', 'Singapore', 'Qatar', 'Botswana',
       'Mauritius', 'Chile', 'Bahrain', 'Cyprus', 'Haiti', 'Guyana',
       'Cameroon', 'Sudan', 'Japan', 'Burkina Faso', 'Colombia', 'Chad',
       'Oman', 'Kyrgyzstan', 'Syria', 'Thailand', 'Nigeria', 'Tuvalu',
       'Republic of the Congo', 'Somalia', 'Uzbekistan', 'Djibouti',
       'Guinea', 'Zimbabwe', 'Mongolia', 'El Salvador', 'Saudi Arabia',
       'Palau', 'Eritrea', 'Belize', 'Gabon', 'Kenya',
       'Sao Tome and Principe', 'Ghana', 'Mexico', 'Niger', 'Panama',
       'Togo', 'Kiribati', 'Nicaragua', 'Namibia', 'South Africa',
       'Honduras', 'Micronesia', 'Nauru', 'Eswatini', 'Malaysia',
       'Central African Republic', 'Vietnam', 'Ethiopia', 'Uganda',
       'DR Congo', 'Afghanistan', 'Angola', 'Benin', 'Tajikistan',
       'Gambia', 'Vanuatu', 'Ivory Coast', 'Equatorial Guinea',
       'Guinea-Bissau', 'Bolivia', 'Sri Lanka', 'Lesotho', 'Maldives',
       'Comoros', 'Zambia', 'Burundi', 'Pakistan', 'Ecuador', 'Bhutan',
       'Tanzania', 'Peru', 'Myanmar', 'India', 'Sierra Leone', 'Brunei',
       'Indonesia', 'Rwanda', 'Malawi', 'Mauritania', 'Liberia',
       'Cambodia', 'Marshall Islands', 'Philippines', 'Madagascar',
       'Bangladesh', 'Yemen', 'Nepal', 'Guatemala', 'Mozambique',
       'Papua New Guinea', 'Solomon Islands', 'Laos', 'Timor-Leste'],
      dtype=object)

In [29]:
df['Country Name'].nunique()

199

In [ ]:
wholesale_data=pd.read_csv